10/data/attachments/8590be295a61bf4b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Danielle_until_Friend_18772_9</nif:username>
            <nif:friendToBeRequested>soap_friends_47580c54-8541-4191-83be-e518dcba4b04</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>